In [19]:
import numpy as np
import pandas as pd
state=['Ohio','Ohio','Ohio','Neveda','neveda',"Neveda"]
data={'state':state,'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
     }
frame2=pd.DataFrame(data,columns=['year','state','pop','debt',],index=['one','two','three','four','five','six'])

ln=len(frame2)
rng=np.arange(ln)

frame2['debt']=rng
val=pd.Series([1.2,3.4,4.6,-1.2,4.6,7.8])
lst=val.values
frame2['ABC']=lst
frame2

       year   state  pop  debt  ABC
one    2000    Ohio  1.5     0  1.2
two    2001    Ohio  1.7     1  3.4
three  2002    Ohio  3.6     2  4.6
four   2001  Neveda  2.4     3 -1.2
five   2002  neveda  2.9     4  4.6
six    2003  Neveda  3.2     5  7.8

In [23]:
obj3=pd.Series(['blue','purple','yellow'],index=[1,3,5])
print(obj3)
obj3=obj3.reindex(range(9),method='ffill')
obj3

1      blue
3    purple
5    yellow
dtype: object

0       NaN
1      blue
2      blue
3    purple
4    purple
5    yellow
6    yellow
7    yellow
8    yellow
dtype: object

In [34]:
states=pd.DataFrame(np.arange(9).reshape((3,3)),
index=['a','b','c'],columns=['Ohio','Texas','California'])

In [35]:
states

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [36]:
states=states.reindex(['a','b','c','d'],method='ffill')
print(states)

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8